       01 STUDENT-REC.
          05 STU-ID           PIC 9(4).
          05 STU-NAME         PIC X(25).
          05 STU-BIRTHDAY     PIC 9(8).
          05 STU-COURSE       PIC X(15).
          05 STU-INSERT-DATE  PIC 9(8).
          05 STU-UPDATE-DATE  PIC 9(8).